<?

/*****************************************************

changenick.php
닉네임 변경을 처리하는 부분이다.
유해한 단어로의 변경 및 변경 전 유효성을 검증한다.

*****************************************************/

session_start();
$connect = mysqli_connect(/*개인 DB정보 입력*/) or alert("DB 접속에 실패하였습니다.");
$connect->query("set names utf8");

if(!$_POST || !$_SESSION[email] || !$_SESSION[nickname]) alert("정보가 제대로 넘어오지 않았습니다. 다시 시도해 주시기 바랍니다.");

//세션 email에 기반한 정보를 가져온다.
$sql = "select * from quitalk_member where email='{$_SESSION[email]}'";
$member=mysqli_fetch_array(mysqli_query($connect,$sql),MYSQLI_BOTH);

if(!$member[email])
	alert("일시적으로 오류가 발생하였습니다. 다시 시도하시거나, 로그아웃 후 다시 로그인해주세요.");

if($member[nickname] == $_POST[nickname])
	alert("닉네임 변동사항이 없습니다.");

//포인트가 1000이 넘는지 확인한다.
if($member[points] < 1000)
	alert("닉네임을 변환하기 위한 포인트가 부족합니다.");

$sql = "select nickname from quitalk_member where nickname='{$_POST[nickname]}'";
$chk=mysqli_fetch_array(mysqli_query($connect,$sql),MYSQLI_BOTH);

if($chk[nickname])
	alert("이미 존재하는 닉네임입니다.");

if(preg_match('/[^0-9a-zA-Z\x{1100}-\x{11FF}\x{3130}-\x{318F}\x{AC00}-\x{D7AF}ㄱ-ㅎㅏ-ㅣ]+/u',$_POST[nickname]))
	alert("닉네임은 한글,숫자,영대소문자로만 입력가능합니다.");

//닉네임의 길이를 검사한다.
if(mb_strlen($_POST[nickname])<2 || mb_strlen($_POST[nickname])>6)
	alert("닉네임은 2자 이상 6자 이하로 입력하셔야 합니다.");

//닉네임의 유해성을 결정한다.
$filter = array('10새','10새기','10새리','10세리','10쉐이','10쉑','10스','10쌔','10쌔기','10쎄','10알','10창','10탱','18것','18넘','18년','18노','18놈','18뇬','18럼','18롬','18새','18새끼','18색','18세끼','18세리','18섹','18쉑','18스','18아','c파','c팔','fuck','ㄱㅐ','ㄲㅏ','ㄲㅑ','ㄲㅣ','ㅅㅂㄹㅁ','ㅅㅐ','ㅆㅂㄹㅁ','ㅆㅍ','ㅆㅣ','ㅆ앙','ㅍㅏ','凸','갈보','갈보년','강아지','같은년','같은뇬','개같은','개구라','개년','개놈','개뇬','개대중','개독','개돼중','개랄','개보지','개뻥','개뿔','개새','개새기','개새끼','개새키','개색기','개색끼','개색키','개색히','개섀끼','개세','개세끼','개세이','개소리','개쑈','개쇳기','개수작','개쉐','개쉐리','개쉐이','개쉑','개쉽','개스끼','개시키','개십새기','개십새끼','개q','개씹','개아들','개자슥','개자지','개접','개좆','개좌식','개허접','걔새','걔수작','걔시끼','걔시키','걔y','걸레','게색기','게색끼','광뇬','구녕','구라','구멍','그년','그새끼','냄비','놈현','뇬','눈깔','뉘미럴','니귀미','니기미','니미','니미랄','니미럴','니미씹','니아배','니아베','니아비','니어매','니어메','니어미','닝기리','닝기미','대가리','뎡신','도라이','돈놈','돌아이','돌은놈','되질래','뒈져','뒈져라','뒈진','뒈진다','뒈질','뒤질래','등신','디져라','디진다','디질래','딩시','따식','때놈','또라이','똘아이','똘아이','뙈놈','뙤놈','뙨넘','뙨놈','뚜쟁','띠바','띠발','띠불','띠팔','메친넘','메친놈','미췬','미췬','미친','미친넘','미친년','미친놈','미친새끼','미친스까이','미틴','미틴넘','미틴년','미틴놈','바랄년','병자','뱅마','뱅신','벼엉신','병쉰','병신','부랄','부럴','불알','불할','붕가','붙어먹','뷰웅','븅','븅신','빌어먹','빙시','빙신','빠가','빠구리','빠굴','빠큐','뻐큐','뻑큐','뽁큐','상넘이','상놈을','상놈의','상놈이','새갸','새꺄','새끼','새새끼','새키','색끼','생쑈','세갸','세꺄','세끼','섹스','쇼하네','쉐','쉐기','쉐끼','쉐리','사까시','씹질','오랄','보지','구녕','쉐에기','쉐키','쉑','','쉬발','쉬밸','쉬벌','쉬뻘','쉬펄','쉽알','스패킹','스팽','시궁창','시끼','시댕','시뎅','시랄','시발','시벌','시부랄','시부럴','시부리','시불','시브랄','시팍','시팔','시펄','신발끈','심발끈','심탱','십8','십라','십새','십새끼','십세','십쉐','십쉐이','십스키','십쌔','십창','십탱','싶알','싸가지','싹아지','쌉년','쌍넘','쌍년','쌍놈','쌍뇬','쌔끼','쌕','쌩쑈','b년','썅','썅년','썅놈','쇼','써벌','썩을년','썩을놈','쎄꺄','쎄엑','쒸벌','쒸뻘','쒸팔','쒸펄','쓰바','쓰박','쓰발','쓰벌','쓰팔','씁새','씁얼','씌파','씨8','씨끼','씨댕','씨뎅','씨바','씨바랄','씨박','씨발','씨방','씨방새','씨방세','씨밸','씨뱅','씨벌','씨벨','씨봉','씨봉알','씨부랄','씨부럴','씨부렁','씨부리','씨불','씨붕','씨브랄','씨빠','씨빨','씨뽀랄','씨앙','씨파','씨팍','씨팔','씨펄','씸년','씸뇬','씸새끼','씹같','씹년','씹뇬','씹보지','씹새','씹새기','씹새끼','씹새리','씹세','씹쉐','씹스키','씹쌔','씹이','씹자지','씹질','씹창','씹탱','유머해소','보지','정액','자위','항문','해소','운영','관리','hae','haeso','퀴톡','quitalk','김현우','현우','운지','섻스','쉓스','쎅스','\'','\"','!','@','#','$','%','^','&','*','(',')');
for($i=0;$i<count($filter);$i++)
{
	if(preg_match('/'.$filter[$i].'/',$_POST[nickname]))
		alert("해당 닉네임은 사용하기 부적절한 닉네임입니다.");
}

$nickname = mysqli_real_escape_string($connect,$_POST[nickname]);

//포인트를 감소시킨다.
mysqli_query($connect,"update quitalk_member set points=points-1000 where email='{$_SESSION[email]}'");

//닉네임을 변환한다.
mysqli_query($connect,"update quitalk_member set nickname='{$nickname}' where email='{$_SESSION[email]}'");

//2015-08-08 아이템 보유 및 친구 요청 대기 목록에서도 닉네임을 변경한다.
mysqli_query($connect,"update quitalk_friend set friend1nick='{$nickname}' where friend1nick='{$_SESSION[nickname]}'");
mysqli_query($connect,"update quitalk_friend set friend2nick='{$nickname}' where friend2nick='{$_SESSION[nickname]}'");
mysqli_query($connect,"update quitalk_hopscotch set solver='{$nickname}' where solver='{$_SESSION[nickname]}'");

$_SESSION[passed] = 1;
//2015-08-08 nickname에 대한 session을 재발급한다.
unset($_SESSION[nickname]);
$_SESSION[nickname] = $nickname;
alert("성공적으로 변환되었습니다.");

function alert($str)
{
	die("<script>alert('".$str."');location.href='info.php';</script>");
}